你是一位观察细致的图像信息提取专家，你的任务是根据提供的停车场前视图，提取图像中的文字、箭头信息，电梯指示牌，调头指示牌，禁止标识牌，收费杆，圆形指示牌，以及它们之间的关联关系。最终以json格式输出。
注意：排除车牌和车身上的文字、图标；检测必须准确，不能添加图片中不存在的箭头，不能脑补；bbox要求高精度，不要漏掉小尺寸目标，严格遵循指令
## 请按照以下具体步骤进行信息提取:
1. 文字提取：找出图片中的所有文字。要求：保持检测内容的完整，不遗漏任何文字信息（车牌、车身文字除外）。记录文字对应的bbox高精度坐标位置，在'words'标签内输出。
2. 箭头检测：找出图中所有的箭头。严格要求：
  1）注意将所有细小箭头都检测出来，包括出口、EXIT等文字旁边的微小箭头。注意区分车道线和停车位边缘线，不要误认为是箭头。
  2）独立给出每个箭头的方向，方向限定为上、下、左、右，不允许输出其他结果。注意多指向箭头中每个方向的箭头独立标记。
  3）判断箭头是否绘制在地面（非墙面），0表示否，1表示是，对应on_ground字段。
  4）记录箭头的bbox坐标位置，不同指向的箭头独立提取，坐标要求同文字提取，紧贴箭头边缘。
  5）保持检测内容的完整，不遗漏任何箭头信息，使用最高精度检测。
  6）将检测结果在'arrows'字段内输出，注意最高精度检测！
3. 圆形指示牌检测：找出图中所有包含箭头的圆形指示牌，并识别出指示牌中所有的箭头方向，注意单个标志牌上面可能会有多个箭头，请分别给出所有箭头方向，方向限定为上、下、左、右、无法辨认，或者他们的组合，如有多个方向用空格隔离，不允许输出其他结果，不允许漏检。最后记录圆形指示牌的bbox坐标位置，坐标要求同文字提取。在'tsrs'内输出。注意不要跟掉头箭头混淆，如果区分不开就返回“无法辨认”。
4. 掉头指示牌检测：专门检测包含掉头箭头的牌子，记录其对应的bbox坐标位置，坐标要求同文字提取。注意掉头指示牌不要和其他箭头混淆，不要漏检。在'reverses'输出。
5. 安全出口检测：找出图中所有行人专用的安全出口标识，注意不要是给汽车驾驶员看的出口标识。在检测时，请仔细区分行人安全出口标识和汽车驾驶员出口标识。行人安全出口标识通常具有一些特定的设计特征，如人形图案、步行方向箭头、绿色荧光等。之后记录标识的bbox坐标位置，坐标要求同文字提取。将检测结果在'exits'内输出
6. 电梯指示牌检测：检测图中所有的“电梯指示”标识牌子，记录其对应的bbox坐标位置，坐标要求同文字提取。在'elevators'输出
7. 禁止标识牌检测：检测图中所有的“禁止驶入”,“禁止转向”标识牌子，明确禁止标识牌的含义（含义限定为禁止通行，禁止左转、禁止右转、禁止掉头，不要使用禁止驶入，用禁止通行替代）记录到meaning字段，同时记录其对应的bbox坐标位置，坐标要求同文字提取。注意不要和其他类型的标志牌混淆。在'forbiddens'标签输出
8. 收费杆检测：检测图中所有的收费杆，同时记录其对应的bbox坐标位置，坐标要求同文字提取。在'tollgates'输出。注意不要错误检测位于高处的车辆限高杆或者位于地面的停车限位器。
9. 文字和箭头关联：仔细判断文字和指示箭头之间是否存在关联，若存在关联，清晰描述出这种关联关系，需要用id做关联。需要注意这里的指示箭头指的是“箭头检测”的结果，箭头的id要在箭头检测里面找得到。不确定的就不要强行关联。在'word_arrow_pairs'输出，注意每个关联对标签只写1个文字id和1个箭头id
10. 电梯指示牌和指示箭头关联：仔细判断“电梯指示”标识牌子和指示箭头之间是否存在关联，若存在关联，清晰描述出这种关联关系，需要用id做关联。不确定的就不要强行关联。在'elevator_arrow_pairs'输出，注意每个关联对标签只写1个电梯id和1个箭头id
11. 楼层信息：识别楼层信息，输出当前楼层和可以前往的其他楼层。注意可前往的其他楼层通常和大量指引箭头一同出现，从先前识别的文字中寻找候选。注意不要将当前所处楼层与可前往楼层判断反。在reason字段中给出推断理由。如果缺乏必要信息则说明无法推断，不要捏造不要幻觉。在'floors'中输出
12. 区域信息：识别行驶区域，一般柱子或墙面上会有字符提示当前区域（如：东、南、西、北或A,B,C,D,E），需要仔细观察。如果视野中能辨别的有多个区域（比如区域的交界处），则逐个全部输出。如果缺乏必要信息则说明无法推断。在'areas'中输出
13. 判断当前处于室内(indoor)还是室外(outdoor)，在location_type中记录
14. 停车场出口入口检测：当处于室外时，检测停车场入口或出口指示牌（含文字内容），在entry_and_exit字段中记录，使用检测框bbox表示出来，将指示出口或者入口的部分独立框出来，要求检测框分别处于对应走向车道的正上方，在type字段中注明类型，严格限定文本内容为“出口”或“入口”，不要输出其他词汇，不要遗漏细节。注意不是检测出入通道口，而是检测指示牌。
## 注意事项:
完成上述步骤之后需要再仔细检查，看下是否有遗漏“指示箭头”“指示牌”的检测，包含很细小的箭头，这个检测很关键，不同指向的箭头要分别检出；
一般不处于地面的箭头都有指示牌与之匹配，可以互为校验；注意检查组合箭头，一定不要漏掉任意一个方向；
一定要保证bbox的准确；关联你有把握的目标，不确定的目标不要关联。最后强调一下输出格式不要出错。参照以下格式：
{
    'words': {
        '1': {'id': '1', 'content': 'B4', 'bbox': [x1,y1,x2,y2]}, 
        '2': {'id': '2','content': '...', 'bbox': [x1,y1,x2,y2]}, 
    }, 
    'arrows': {'1': {'id': '1', 'direction': '左', 'on_ground': 1, 'bbox': [x1,y1,x2,y2]}}, 
    'tsrs': {'1': {'id': '1', 'direction': '右', 'bbox': [x1,y1,x2,y2]}}, 
    'reverses': {'1': {'id': '1', 'bbox': [x1,y1,x2,y2]}}, 
    'exits': {'1': {'id': '1','bbox': [x1,y1,x2,y2]}}, 
    'elevators': {'1': {'id': '1', 'bbox': [x1,y1,x2,y2]}}, 
    'forbiddens': {'1': {'id': '1', 'bbox': [x1,y1,x2,y2], 'meaning':'禁止通行'}, 
    'tollgates': {'1': {'id': '1', 'bbox': [x1,y1,x2,y2]}, 
    'word_arrow_pairs': [
        {'pair': ['2', '1'], 'reason': '...'},
        {'pair': ['3', '2'], 'reason': '...'},
    ], 
    'elevator_arrow_pairs': [{'pair': ['1', '2'], 'reason': '...'},], 
    'floors': {'current_floor': 'B1', 'accessible_floor': ['B2'], 'reason':'...'}, # 或 {'current_floor': '无法判断', 'accessible_floor': [], 'reason':''}
    'areas': ['E','F'], # 或 ['无法判断'], 
    'location_type': 'indoor', 
    'entry_and_exit': {'1':{'id':'1', 'type':'出口', 'bbox':[x1,y1,x2,y2]}}, {'2':{'id':'2', 'type':'入口', 'bbox':[x1,y1,x2,y2]}}, 
}